<a href="https://colab.research.google.com/github/Jitendra-Dash/Python-For-Data-Science/blob/main/Pandas_For_Data_Science_Machine_Learning_part_1_.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **Pandas - For Data Science / Machine Learning**
- Pandas is an open-source library.
- Pandas is used for data manipulation in ML.
- Easy to use data structures and data analysis tools for the Python programming language.

In [3]:
# import Pandas 
# if you are using your local box then install as follows
# write in your command prompt pip3 install pandas


import pandas as pd

**It has 2 data stucture (for manipulation)**
 1. series
 2. Data Frame

### Panda Series :

we can think as column in a table

In [9]:
# crate a series

# create the pandas series object
series = pd.Series() 

# now print it

print(series)
print("\n ******************************************************* \n")

# what we can pass to the series object ?
# refer : https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.html
# we can see we can pass an array, Iterable, dict, or scalar value

# lets create an array using numpy

# for that  we have to import another library which is numpy

import numpy as np

# arry = np.array()

# what to pass to the arry object ? 
# refer : https://numpy.org/doc/stable/reference/generated/numpy.array.html
# we can pass a list here

arry  = np.array(['a','b','c','d'])

#pass the array into the series
series = pd.Series(arry)

print(series)

Series([], dtype: float64)

 *******************************************************

0    a
1    b
2    c
3    d
dtype: object

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:4: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  after removing the cwd from sys.path.

## Pandas DataFrame
we can think as a table which has rows and columns

In [11]:
# creating a Data Frame

# create a string using list

strng = ["we","will","learn","pandas"]

# create a pandas data frame object and pass the above string(list)

# refer : https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.html

df = pd.DataFrame(strng)

df

        0
0      we
1    will
2   learn
3  pandas

In [18]:
# we can pass dict to pandas data frame
# lets create a dict

dct = {"Roll number" : [101,102,103,104,105,106] , "Student Names": ["ABCD" , "EFGH" ,"IJKL","MNOP","QRST","UVWX"]}

# create a data frame

df = pd.DataFrame(dct)

df

   Roll number Student Names
0          101          ABCD
1          102          EFGH
2          103          IJKL
3          104          MNOP
4          105          QRST
5          106          UVWX

There are number of way we can create Data frame
- Pandas Dataframe from list of list
- Pandas Dataframe from list using Zip
- Pandas Dataframe from list of dicts

In [22]:
# lets take the above example

# Pandas Dataframe from list of list
# create list of list (nested list)

lst_of_lst = [ [101,"ABCD"], [102,"EFGH"], [103,"IJKL"], [104,"MNOP"], [105,"QRST"], [106,"UVWX"] ]
print(lst_of_lst)

# create a data frame object

df = pd.DataFrame(lst_of_lst , columns=["Roll number" , "Student names"])

df

[[101, 'ABCD'], [102, 'EFGH'], [103, 'IJKL'], [104, 'MNOP'], [105, 'QRST'], [106, 'UVWX']]

   Roll number Student names
0          101          ABCD
1          102          EFGH
2          103          IJKL
3          104          MNOP
4          105          QRST
5          106          UVWX

In [20]:
# Pandas Dataframe from list using Zip


roll_numb = [101,102,103,104,105,106]
student_names = ["ABCD" , "EFGH" ,"IJKL","MNOP","QRST","UVWX"]

# lets zip it

z = list(zip(roll_numb,student_names))
print(z)
print("----------------------------------------------------------------------------------------------------------")

# lets create a data frame object
df = pd.DataFrame(z , columns=["Roll number" , "Student names"])

df

[(101, 'ABCD'), (102, 'EFGH'), (103, 'IJKL'), (104, 'MNOP'), (105, 'QRST'), (106, 'UVWX')]
----------------------------------------------------------------------------------------------------------

   Roll number Student names
0          101          ABCD
1          102          EFGH
2          103          IJKL
3          104          MNOP
4          105          QRST
5          106          UVWX

In [29]:
#Pandas Dataframe from list of dicts
# lets create dicts and pass it on list

lst_of_dict = [  {"a":1 , "b":2 , "c":3,"d":4} ,  {"a":11,"b":12,"c":13,"d":14}  ]

print(lst_of_dict)

# create a pandas object and pass the above object

df = pd.DataFrame(lst_of_dict )

df

[{'a': 1, 'b': 2, 'c': 3, 'd': 4}, {'a': 11, 'b': 12, 'c': 13, 'd': 14}]

    a   b   c   d
0   1   2   3   4
1  11  12  13  14